

//=============================================================================
// INCLUDE
//=============================================================================
#include "../../../../../Include/Lue.h"


//=============================================================================
// DEFINE
//=============================================================================
#define SCREEN_WIDTH	(640)		// 画面横幅
#define SCREEN_HEIGHT	(480)		// 画面縦幅

#define POINT_MAX		(4096)		// ポイント数


//=============================================================================
/**
	@brief メイン関数

	@param hInstance		[in] 現在のインスタンスのハンドル
	@param hPrevInstance	[in] 以前のインスタンスのハンドル
	@param lpCmdPoint		[in] コマンドポイント
	@param nCmdShow			[in] 表示状態

	コンソールアプリケーションでいう所の main() 関数です。
	ウィンドウズアプリケーションでは以下の関数が main() になります。
*/
//=============================================================================
int WINAPI WinMain( HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdPoint, int nCmdShow )
{
	LueVertex2D Point;
	LUE_HANDLE hPoint;
	long i;

	//--------------------------------------------------------
	// Lue初期化
	//--------------------------------------------------------
	if ( !Lue_Initialize(
			"Lue Sample Program",		// アプリケーション名
			SCREEN_WIDTH,				// ウィンドウ横幅
			SCREEN_HEIGHT,				// ウィンドウ縦幅
			LFRAME_RATE_60,				// フレームレート（1秒間のフレーム数）
			LTRUE,						// ウィンドウモードで起動するかどうか
			LAPI_TYPE_DIRECTX9 ) )		// 固定
	{
		return 1;
	}

	//--------------------------------------------------------
	// ポイント用描画オブジェクト生成
	//  点はシザリングをしても頂点数が変わらないので
	//  余分に確保する必要はない。
	//--------------------------------------------------------
	hPoint = LuePointPrimitive2D_Create( POINT_MAX );

	//--------------------------------------------------------
	// メインループ
	//   ALT+F4でアプリケーションの終了。
	//   ALT+ENTERで画面モードの切り替え
	//
	// Lue_Run()はウィンドウを使ったゲームで必須の処理が
	// 内部に組み込まれています。
	// ウィンドウを正常に終了させた場合は LFASE が返りますので
	// その時はループから抜けるような作りにして下さい。
	//--------------------------------------------------------
	while ( Lue_Run( LFALSE ) )
	{
		///////////////////////////////////////////////////////////////// ポイントへの描画リクエスト

		// ポイントへの描画開始を通知
		LuePointPrimitive2D_Begin( hPoint );

		// ポイントに対して描画
		for ( i = 0; i < POINT_MAX; i++ )
		{
			// 頂点
			Point.Pos.x = (float)(rand() % (SCREEN_WIDTH/2))  + (SCREEN_WIDTH /4);
			Point.Pos.y = (float)(rand() % (SCREEN_HEIGHT/2)) + (SCREEN_HEIGHT/4);
			Point.Pos.z = 0.0f;
			Point.Pos.w = 1.0f;
			Point.Col   = LUE_RGB(255,255,255);
			// ポイントに描画をリクエスト
			LuePointPrimitive2D_Push( hPoint, &Point, 1 );
		}

		// ポイントへの描画完了を通知
		LuePointPrimitive2D_End( hPoint );

		///////////////////////////////////////////////////////////////// レンダラーへの描画処理

		// 描画開始宣言
		LueRender_SceneStart();

		// テクスチャ設定無し
		LueRender_SetTexture( INVALID_LUE_HANDLE );

		// ポイントバッファの内容を画面に描画
		LuePointPrimitive2D_Rendering( hPoint );

		// 描画終了宣言
		LueRender_SceneExit();
	}

	//--------------------------------------------------------
	// ポイントオブジェクト解放
	//--------------------------------------------------------
	LuePointPrimitive2D_Release( hPoint );

	//--------------------------------------------------------
	// Lue終了
    //   Lueで使用している全データを解放します。
	//--------------------------------------------------------
	Lue_Finalize();

	return 0;
}


