

//=====================================================================
// INCLUDE
//=====================================================================
#include <windows.h>
#include <stdio.h>
#include "FilePack.h"


//=====================================================================
/**
*/
//=====================================================================
void main( int argv, char *args[] )
{
	if ( argv < 2 )
	{
		printf( "+-----------------------------------------------------------+\n" );
		printf( "|               File Packing Tool  ver.1.00                 |\n" );
		printf( "+-----------------------------------------------------------+\n" );
		printf( "|                                          2006.06.01 N.Lee |\n" );
		printf( "+-----------------------------------------------------------+\n" );
		printf( "|　・指定フォルダを１つのファイルにまとめるツールです       |\n" );
		printf( "|　　引数にはファイルを指定してください。                   |\n" );
		printf( "|　　ドラッグでも問題ありません。                           |\n" );
		printf( "+-----------------------------------------------------------+\n" );
		printf( "|   PackDir [input1] [input2] ...                           |\n" );
		printf( "|       input  : source directory name                      |\n" );
		printf( "+-----------------------------------------------------------+\n" );
	}
	else
	{
		for ( int i = 1; i < argv; i++ )
		{
			CFilePack Pack;
			if ( (::GetFileAttributes( args[i] ) & FILE_ATTRIBUTE_DIRECTORY) != 0 )
			{
				Pack.Encode( args[i], 0 );
			}
			else
			{
				Pack.Decode( args[i] );
			}
		}
	}
}

