

//=============================================================================
// INCLUDE
//=============================================================================
#include "../../../../../Include/Lue.h"


//=============================================================================
// DEFINE
//=============================================================================
#define SCREEN_WIDTH	(640)		// 画面横幅
#define SCREEN_HEIGHT	(480)		// 画面縦幅

#define LINE_MAX		(512)		// ライン数
#define LINE_SIZE_X		(20.0f)		// ラインXサイズ
#define LINE_SIZE_Y		(50.0f)		// ラインYサイズ


//=============================================================================
/**
	@brief メイン関数

	@param hInstance		[in] 現在のインスタンスのハンドル
	@param hPrevInstance	[in] 以前のインスタンスのハンドル
	@param lpCmdLine		[in] コマンドライン
	@param nCmdShow			[in] 表示状態

	コンソールアプリケーションでいう所の main() 関数です。
	ウィンドウズアプリケーションでは以下の関数が main() になります。
*/
//=============================================================================
int WINAPI WinMain( HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdLine, int nCmdShow )
{
	LueLinePrimitiveVertex2D Line;
	LUE_HANDLE hLine;
	long i;

	//--------------------------------------------------------
	// Lue初期化
	//--------------------------------------------------------
	if ( !Lue_Initialize(
			"Lue Sample Program",		// アプリケーション名
			SCREEN_WIDTH,				// ウィンドウ横幅
			SCREEN_HEIGHT,				// ウィンドウ縦幅
			LFRAME_RATE_60,				// フレームレート（1秒間のフレーム数）
			LTRUE,						// ウィンドウモードで起動するかどうか
			LAPI_TYPE_DIRECTX9 ) )		// 固定
	{
		return 1;
	}

	//--------------------------------------------------------
	// ライン用描画オブジェクト生成
	//  線分は頂点２つから成るのでｘ２で渡す
	//  線分はシザリングをしても頂点数が変わらないので
	//  余分に確保する必要はない。
	//--------------------------------------------------------
	hLine = LueLinePrimitive2D_Create( LINE_MAX * 2 );

	//--------------------------------------------------------
	// メインループ
	//   ALT+F4でアプリケーションの終了。
	//   ALT+ENTERで画面モードの切り替え
	//
	// Lue_Run()はウィンドウを使ったゲームで必須の処理が
	// 内部に組み込まれています。
	// ウィンドウを正常に終了させた場合は LFASE が返りますので
	// その時はループから抜けるような作りにして下さい。
	//--------------------------------------------------------
	while ( Lue_Run( LFALSE ) )
	{
		///////////////////////////////////////////////////////////////// ラインへの描画リクエスト

		// ラインへの描画開始を通知
		LueLinePrimitive2D_Begin( hLine );

		// ラインに対して描画
		for ( i = 0; i < LINE_MAX; i++ )
		{
			// 頂点１
			Line.v[0].Pos.x = (float)(rand() % SCREEN_WIDTH)  - (LINE_SIZE_X / 2.0f);
			Line.v[0].Pos.y = (float)(rand() % SCREEN_HEIGHT) - (LINE_SIZE_Y / 2.0f);
			Line.v[0].Pos.z = 0.0f;
			Line.v[0].Pos.w = 1.0f;
			Line.v[0].Col   = LUE_RGB(128,128,128);
			// 頂点２
			Line.v[1] = Line.v[0];
			Line.v[1].Pos.x += LINE_SIZE_X;
			Line.v[1].Pos.y += LINE_SIZE_Y;
			// ラインに描画をリクエスト
			LueLinePrimitive2D_Push( hLine, &Line, 1 );
		}

		// ラインへの描画完了を通知
		LueLinePrimitive2D_End( hLine );

		///////////////////////////////////////////////////////////////// レンダラーへの描画処理

		// 描画開始宣言
		LueRender_SceneStart();

		// テクスチャ設定無し
		LueRender_SetTexture( INVALID_LUE_HANDLE );

		// ラインバッファの内容を画面に描画
		LueLinePrimitive2D_Rendering( hLine );

		// 描画終了宣言
		LueRender_SceneExit();
	}

	//--------------------------------------------------------
	// ラインオブジェクト解放
	//--------------------------------------------------------
	LueLinePrimitive2D_Release( hLine );

	//--------------------------------------------------------
	// Lue終了
    //   Lueで使用している全データを解放します。
	//--------------------------------------------------------
	Lue_Finalize();

	return 0;
}


